readers = {1, 2, 3, 4} 
books = {"1984","Марсианин", "Автостопом по галактике", "Ведьмак","Властелин колец","Сто лет одиночества","Мастер и Маргарита","Маленький принц" }
genres = {"Социальная фантастика", "Научная фантастика", "Комедия", "Фэнтези","Эпическое фэнтези","Магический реализм","Роман","Философская сказка"} 

reader_to_book ={
    1: {"1984", "Ведьмак"},
    2: {"Автостопом по галактике", "Властелин колец"}, 
    3: {"Мастер и Маргарита", "Маленький принц"},
    4: {"Сто лет одиночества"}      
}

book_to_genre = {
    "1984":"Социальная фантастика",
    "Марсианин":"Научная фантастика",
    "Автостопом по галактике":"Комедия",
    "Ведьмак":"фэнтези",
    "Властелин колец":"Эпическое фэнтези",
    "Сто лет одиночества":"Магический реализм",
    "Мастер и маргарита":"Роман",
    "Маленький принц":"Философская сказка"
} 
# kompozicia
reader_to_genre = 0


def is_functional(pairs):
 pass

def is_everywhere_defined(domain, pairs):
 pass


def is_injective(pairs):
 pass

def is_surjective(pairs, codomain):
 pass

def image(pairs, subset_A):
 pass

def preimage(pairs, subset_B):
 pass

def proj_A(pairs):
 pass


def proj_B(pairs):
 pass

def compose_via(f_pairs, g_pairs):
 pass